<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use DB;

class MenuSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $menu_data = [
            "Аналитика  Курской области" => [
                "Презентация региона" => "#",
                "Социально-экономическое развитие" => "#",
                "О ГЧП в регионе" => "#",
                "Развитие экспорта" => "#",
                "Стандарт развития конкуренции" => "#",
                "Совет по улучшению инвест климата" => "#",
                "План создания объектов инфраструктуры" => "#",
                "Витрина инвестиционных проектов" => "#",
                "Муниципальный инвестиционный стандарт Курской области" => "#",
            ],

            "Путь инвестора" => [
                "Регламент «одного окна» для инвестора (подать заявку)" => "#",
                "Подобрать земельный участок" => "#",
                "Меры господдержки" => "#",
            ],

            "Инвестиционные площадки" => [
                "ОЭЗ «Третий Полюс»" => "#",
                "Индустриальные парки" => "#",
                "Реестр земельных участков" => "#",
            ],

            "Инвестиционная карта" => [

            ],

            "Навигатор мер поддержки" => [
                "Законодательство" => "#",
                "Меры господдержки" => "#",
            ],

            "Экспертам АСИ" => [
                "Инвестиционный стандрат Курской области 2.0" => "#",
                "Социально-экономическая стратегия развития Курской области" => "#",
                "Меры господдержки" => "#",
                "Линия прямых обращений" => "#",
                "Регламент «одного окна» для инвестора" => "#",
                "Реестр инвестиционных проектов" => "#",
                "План создания объектов инфраструктуры" => "#",
            ]

        ];



        $i = 1;
        foreach ( $menu_data as $key => $item) {
            $element = [
                'menu_name' => "Общее меню",
                'lnk' => "#",
                'order' => $i,
                'parent' => 0,
                'title' => $key,
            ];

            $p_id = DB::table("menus")->insertGetId($element);

            $j = 0;
            foreach ($item as $key => $subitem) {
                $sub_element = [
                    'menu_name' => "Общее меню",
                    'lnk' => $subitem,
                    'order' => $j,
                    'parent' => $p_id,
                    'title' => $key,
                ];

                DB::table("menus")->insert($sub_element);
                $j++;
            }
            $i++;
        }

        $i = 1;
        foreach ( $menu_data as $key => $item) {
            $element = [
                'menu_name' => "Меню в шапке",
                'lnk' => "#",
                'order' => $i,
                'parent' => 0,
                'title' => $key,
            ];

            $p_id = DB::table("menus")->insertGetId($element);
        }
    }
}
