<?php
    $head_page = [

        'Аналитика Курской области' => [
            "menu_marker" => "Аналитика Курской области",
            "text" => "RUS_analytics_ko.html",
            "img" => "",
            "banner" => "",
        ],

        'Муниципальный инвестиционный стандарт в Курской области' => [
            "menu_marker" => "Муниципальный инвестиционный стандарт в Курской области",
            "text" => "RUS_municipal_investment_standard.html",
            "img" => "",
            "banner" => "",

            "files" => [
                [
                    'title' => "Закон Курской области от 5 декабря 2005 года N 80-ЗКО «Об административно-территориальном устройстве Курской области»",
                    'description' => "",
                    'file' => ""
                ],
                [
                    'title' => "Закон Курской области от 21 октября 2004 года N 48-ЗКО «О муниципальных образованиях Курской области»",
                    'description' => "",
                    'file' => ""
                ],
    
            ],
        ],

        'Инвестиционные площадки' => [
            "menu_marker" => "Инвестиционные площадки",
            "text" => "RUS_investment_sites.html",
            "img" => "",
            "banner" => "",
        ],

        'Путь инвестора' => [
            "menu_marker" => "Путь инвестора",
            "text" => "RUS_investor_way.html",
            "img" => "",
            "banner" => "",
        ],

        'Навигатор мер поддержки' => [
            "menu_marker" => "Навигатор мер поддержки",
            "text" => "RUS_support_nav.html",
            "img" => "",
            "banner" => "",
        ],
    ];
